GopalSaraf/Practicals/PSDL/include/proc/pic18lf46k80.inc
// Register: B4D2
#define B4D2 B4D2
B4D2                                     equ 0EC8h
// bitfield definitions
B4D2_B4D2_POSN                           equ 0000h
B4D2_B4D2_POSITION                       equ 0000h
B4D2_B4D2_SIZE                           equ 0008h
B4D2_B4D2_LENGTH                         equ 0008h
B4D2_B4D2_MASK                           equ 00FFh
B4D2_B4D20_POSN                          equ 0000h
B4D2_B4D20_POSITION                      equ 0000h
B4D2_B4D20_SIZE                          equ 0001h
B4D2_B4D20_LENGTH                        equ 0001h
B4D2_B4D20_MASK                          equ 0001h
B4D2_B4D21_POSN                          equ 0001h
B4D2_B4D21_POSITION                      equ 0001h
B4D2_B4D21_SIZE                          equ 0001h
B4D2_B4D21_LENGTH                        equ 0001h
B4D2_B4D21_MASK                          equ 0002h
B4D2_B4D22_POSN                          equ 0002h
B4D2_B4D22_POSITION                      equ 0002h
B4D2_B4D22_SIZE                          equ 0001h
B4D2_B4D22_LENGTH                        equ 0001h
B4D2_B4D22_MASK                          equ 0004h
B4D2_B4D23_POSN                          equ 0003h
B4D2_B4D23_POSITION                      equ 0003h
B4D2_B4D23_SIZE                          equ 0001h
B4D2_B4D23_LENGTH                        equ 0001h
B4D2_B4D23_MASK                          equ 0008h
B4D2_B4D24_POSN                          equ 0004h
B4D2_B4D24_POSITION                      equ 0004h
B4D2_B4D24_SIZE                          equ 0001h
B4D2_B4D24_LENGTH                        equ 0001h
B4D2_B4D24_MASK                          equ 0010h
B4D2_B4D25_POSN                          equ 0005h
B4D2_B4D25_POSITION                      equ 0005h
B4D2_B4D25_SIZE                          equ 0001h
B4D2_B4D25_LENGTH                        equ 0001h
B4D2_B4D25_MASK                          equ 0020h
B4D2_B4D26_POSN                          equ 0006h
B4D2_B4D26_POSITION                      equ 0006h
B4D2_B4D26_SIZE                          equ 0001h
B4D2_B4D26_LENGTH                        equ 0001h
B4D2_B4D26_MASK                          equ 0040h
B4D2_B4D27_POSN                          equ 0007h
B4D2_B4D27_POSITION                      equ 0007h
B4D2_B4D27_SIZE                          equ 0001h
B4D2_B4D27_LENGTH                        equ 0001h
B4D2_B4D27_MASK                          equ 0080h

// Register: B4D3
#define B4D3 B4D3
B4D3                                     equ 0EC9h
// bitfield definitions
B4D3_B4D3_POSN                           equ 0000h
B4D3_B4D3_POSITION                       equ 0000h
B4D3_B4D3_SIZE                           equ 0008h
B4D3_B4D3_LENGTH                         equ 0008h
B4D3_B4D3_MASK                           equ 00FFh
B4D3_B4D30_POSN                          equ 0000h
B4D3_B4D30_POSITION                      equ 0000h
B4D3_B4D30_SIZE                          equ 0001h
B4D3_B4D30_LENGTH                        equ 0001h
B4D3_B4D30_MASK                          equ 0001h
B4D3_B4D31_POSN                          equ 0001h
B4D3_B4D31_POSITION                      equ 0001h
B4D3_B4D31_SIZE                          equ 0001h
B4D3_B4D31_LENGTH                        equ 0001h
B4D3_B4D31_MASK                          equ 0002h
B4D3_B4D32_POSN                          equ 0002h
B4D3_B4D32_POSITION                      equ 0002h
B4D3_B4D32_SIZE                          equ 0001h
B4D3_B4D32_LENGTH                        equ 0001h
B4D3_B4D32_MASK                          equ 0004h
B4D3_B4D33_POSN                          equ 0003h
B4D3_B4D33_POSITION                      equ 0003h
B4D3_B4D33_SIZE                          equ 0001h
B4D3_B4D33_LENGTH                        equ 0001h
B4D3_B4D33_MASK                          equ 0008h
B4D3_B4D34_POSN                          equ 0004h
B4D3_B4D34_POSITION                      equ 0004h
B4D3_B4D34_SIZE                          equ 0001h
B4D3_B4D34_LENGTH                        equ 0001h
B4D3_B4D34_MASK                          equ 0010h
B4D3_B4D35_POSN                          equ 0005h
B4D3_B4D35_POSITION                      equ 0005h
B4D3_B4D35_SIZE                          equ 0001h
B4D3_B4D35_LENGTH                        equ 0001h
B4D3_B4D35_MASK                          equ 0020h
B4D3_B4D36_POSN                          equ 0006h
B4D3_B4D36_POSITION                      equ 0006h
B4D3_B4D36_SIZE                          equ 0001h
B4D3_B4D36_LENGTH                        equ 0001h
B4D3_B4D36_MASK                          equ 0040h
B4D3_B4D37_POSN                          equ 0007h
B4D3_B4D37_POSITION                      equ 0007h
B4D3_B4D37_SIZE                          equ 0001h
B4D3_B4D37_LENGTH                        equ 0001h
B4D3_B4D37_MASK                          equ 0080h

// Register: B4D4
#define B4D4 B4D4
B4D4                                     equ 0ECAh
// bitfield definitions
B4D4_B4D4_POSN                           equ 0000h
B4D4_B4D4_POSITION                       equ 0000h
B4D4_B4D4_SIZE                           equ 0008h
B4D4_B4D4_LENGTH                         equ 0008h
B4D4_B4D4_MASK                           equ 00FFh
B4D4_B4D40_POSN                          equ 0000h
B4D4_B4D40_POSITION                      equ 0000h
B4D4_B4D40_SIZE                          equ 0001h
B4D4_B4D40_LENGTH                        equ 0001h
B4D4_B4D40_MASK                          equ 0001h
B4D4_B4D41_POSN                          equ 0001h
B4D4_B4D41_POSITION                      equ 0001h
B4D4_B4D41_SIZE                          equ 0001h
B4D4_B4D41_LENGTH                        equ 0001h
B4D4_B4D41_MASK                          equ 0002h
B4D4_B4D42_POSN                          equ 0002h
B4D4_B4D42_POSITION                      equ 0002h
B4D4_B4D42_SIZE                          equ 0001h
B4D4_B4D42_LENGTH                        equ 0001h
B4D4_B4D42_MASK                          equ 0004h
B4D4_B4D43_POSN                          equ 0003h
B4D4_B4D43_POSITION                      equ 0003h
B4D4_B4D43_SIZE                          equ 0001h
B4D4_B4D43_LENGTH                        equ 0001h
B4D4_B4D43_MASK                          equ 0008h
B4D4_B4D44_POSN                          equ 0004h
B4D4_B4D44_POSITION                      equ 0004h
B4D4_B4D44_SIZE                          equ 0001h
B4D4_B4D44_LENGTH                        equ 0001h
B4D4_B4D44_MASK                          equ 0010h
B4D4_B4D45_POSN                          equ 0005h
B4D4_B4D45_POSITION                      equ 0005h
B4D4_B4D45_SIZE                          equ 0001h
B4D4_B4D45_LENGTH                        equ 0001h
B4D4_B4D45_MASK                          equ 0020h
B4D4_B4D46_POSN                          equ 0006h
B4D4_B4D46_POSITION                      equ 0006h
B4D4_B4D46_SIZE                          equ 0001h
B4D4_B4D46_LENGTH                        equ 0001h
B4D4_B4D46_MASK                          equ 0040h
B4D4_B4D47_POSN                          equ 0007h
B4D4_B4D47_POSITION                      equ 0007h
B4D4_B4D47_SIZE                          equ 0001h
B4D4_B4D47_LENGTH                        equ 0001h
B4D4_B4D47_MASK                          equ 0080h

