GopalSaraf/Practicals/PSDL/include/proc/pic18lf46k80.inc
// Register: CANCON_RO0
#define CANCON_RO0 CANCON_RO0
CANCON_RO0                               equ 0F3Fh
// bitfield definitions
CANCON_RO0_FP0_POSN                      equ 0000h
CANCON_RO0_FP0_POSITION                  equ 0000h
CANCON_RO0_FP0_SIZE                      equ 0001h
CANCON_RO0_FP0_LENGTH                    equ 0001h
CANCON_RO0_FP0_MASK                      equ 0001h
CANCON_RO0_WIN0_FP1_POSN                 equ 0001h
CANCON_RO0_WIN0_FP1_POSITION             equ 0001h
CANCON_RO0_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO0_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO0_WIN0_FP1_MASK                 equ 0002h
CANCON_RO0_WIN1_FP2_POSN                 equ 0002h
CANCON_RO0_WIN1_FP2_POSITION             equ 0002h
CANCON_RO0_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO0_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO0_WIN1_FP2_MASK                 equ 0004h
CANCON_RO0_WIN2_FP3_POSN                 equ 0003h
CANCON_RO0_WIN2_FP3_POSITION             equ 0003h
CANCON_RO0_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO0_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO0_WIN2_FP3_MASK                 equ 0008h
CANCON_RO0_ABAT_POSN                     equ 0004h
CANCON_RO0_ABAT_POSITION                 equ 0004h
CANCON_RO0_ABAT_SIZE                     equ 0001h
CANCON_RO0_ABAT_LENGTH                   equ 0001h
CANCON_RO0_ABAT_MASK                     equ 0010h
CANCON_RO0_REQOP_POSN                    equ 0005h
CANCON_RO0_REQOP_POSITION                equ 0005h
CANCON_RO0_REQOP_SIZE                    equ 0003h
CANCON_RO0_REQOP_LENGTH                  equ 0003h
CANCON_RO0_REQOP_MASK                    equ 00E0h
CANCON_RO0_WIN0_POSN                     equ 0001h
CANCON_RO0_WIN0_POSITION                 equ 0001h
CANCON_RO0_WIN0_SIZE                     equ 0001h
CANCON_RO0_WIN0_LENGTH                   equ 0001h
CANCON_RO0_WIN0_MASK                     equ 0002h
CANCON_RO0_WIN1_POSN                     equ 0002h
CANCON_RO0_WIN1_POSITION                 equ 0002h
CANCON_RO0_WIN1_SIZE                     equ 0001h
CANCON_RO0_WIN1_LENGTH                   equ 0001h
CANCON_RO0_WIN1_MASK                     equ 0004h
CANCON_RO0_WIN2_POSN                     equ 0003h
CANCON_RO0_WIN2_POSITION                 equ 0003h
CANCON_RO0_WIN2_SIZE                     equ 0001h
CANCON_RO0_WIN2_LENGTH                   equ 0001h
CANCON_RO0_WIN2_MASK                     equ 0008h
CANCON_RO0_FP1_POSN                      equ 0001h
CANCON_RO0_FP1_POSITION                  equ 0001h
CANCON_RO0_FP1_SIZE                      equ 0001h
CANCON_RO0_FP1_LENGTH                    equ 0001h
CANCON_RO0_FP1_MASK                      equ 0002h
CANCON_RO0_FP2_POSN                      equ 0002h
CANCON_RO0_FP2_POSITION                  equ 0002h
CANCON_RO0_FP2_SIZE                      equ 0001h
CANCON_RO0_FP2_LENGTH                    equ 0001h
CANCON_RO0_FP2_MASK                      equ 0004h
CANCON_RO0_FP3_POSN                      equ 0003h
CANCON_RO0_FP3_POSITION                  equ 0003h
CANCON_RO0_FP3_SIZE                      equ 0001h
CANCON_RO0_FP3_LENGTH                    equ 0001h
CANCON_RO0_FP3_MASK                      equ 0008h

// Register: PSPCON
#define PSPCON PSPCON
PSPCON                                   equ 0F46h
// bitfield definitions
PSPCON_PSPMODE_POSN                      equ 0004h
PSPCON_PSPMODE_POSITION                  equ 0004h
PSPCON_PSPMODE_SIZE                      equ 0001h
PSPCON_PSPMODE_LENGTH                    equ 0001h
PSPCON_PSPMODE_MASK                      equ 0010h
PSPCON_IBOV_POSN                         equ 0005h
PSPCON_IBOV_POSITION                     equ 0005h
PSPCON_IBOV_SIZE                         equ 0001h
PSPCON_IBOV_LENGTH                       equ 0001h
PSPCON_IBOV_MASK                         equ 0020h
PSPCON_OBF_POSN                          equ 0006h
PSPCON_OBF_POSITION                      equ 0006h
PSPCON_OBF_SIZE                          equ 0001h
PSPCON_OBF_LENGTH                        equ 0001h
PSPCON_OBF_MASK                          equ 0040h
PSPCON_IBF_POSN                          equ 0007h
PSPCON_IBF_POSITION                      equ 0007h
PSPCON_IBF_SIZE                          equ 0001h
PSPCON_IBF_LENGTH                        equ 0001h
PSPCON_IBF_MASK                          equ 0080h

// Register: CCP5CON
#define CCP5CON CCP5CON
CCP5CON                                  equ 0F47h
// bitfield definitions
CCP5CON_CCP5M_POSN                       equ 0000h
CCP5CON_CCP5M_POSITION                   equ 0000h
CCP5CON_CCP5M_SIZE                       equ 0004h
CCP5CON_CCP5M_LENGTH                     equ 0004h
CCP5CON_CCP5M_MASK                       equ 000Fh
CCP5CON_DC5B_POSN                        equ 0004h
CCP5CON_DC5B_POSITION                    equ 0004h
CCP5CON_DC5B_SIZE                        equ 0002h
CCP5CON_DC5B_LENGTH                      equ 0002h
CCP5CON_DC5B_MASK                        equ 0030h
CCP5CON_CCP5M0_POSN                      equ 0000h
CCP5CON_CCP5M0_POSITION                  equ 0000h
CCP5CON_CCP5M0_SIZE                      equ 0001h
CCP5CON_CCP5M0_LENGTH                    equ 0001h
CCP5CON_CCP5M0_MASK                      equ 0001h
CCP5CON_CCP5M1_POSN                      equ 0001h
CCP5CON_CCP5M1_POSITION                  equ 0001h
CCP5CON_CCP5M1_SIZE                      equ 0001h
CCP5CON_CCP5M1_LENGTH                    equ 0001h
CCP5CON_CCP5M1_MASK                      equ 0002h
CCP5CON_CCP5M2_POSN                      equ 0002h
CCP5CON_CCP5M2_POSITION                  equ 0002h
CCP5CON_CCP5M2_SIZE                      equ 0001h
CCP5CON_CCP5M2_LENGTH                    equ 0001h
CCP5CON_CCP5M2_MASK                      equ 0004h
CCP5CON_CCP5M3_POSN                      equ 0003h
CCP5CON_CCP5M3_POSITION                  equ 0003h
CCP5CON_CCP5M3_SIZE                      equ 0001h
CCP5CON_CCP5M3_LENGTH                    equ 0001h
CCP5CON_CCP5M3_MASK                      equ 0008h
CCP5CON_DC5B0_POSN                       equ 0004h
CCP5CON_DC5B0_POSITION                   equ 0004h
CCP5CON_DC5B0_SIZE                       equ 0001h
CCP5CON_DC5B0_LENGTH                     equ 0001h
CCP5CON_DC5B0_MASK                       equ 0010h
CCP5CON_DC5B1_POSN                       equ 0005h
CCP5CON_DC5B1_POSITION                   equ 0005h
CCP5CON_DC5B1_SIZE                       equ 0001h
CCP5CON_DC5B1_LENGTH                     equ 0001h
CCP5CON_DC5B1_MASK                       equ 0020h
CCP5CON_CCP5Y_POSN                       equ 0004h
CCP5CON_CCP5Y_POSITION                   equ 0004h
CCP5CON_CCP5Y_SIZE                       equ 0001h
CCP5CON_CCP5Y_LENGTH                     equ 0001h
CCP5CON_CCP5Y_MASK                       equ 0010h
CCP5CON_CCP5X_POSN                       equ 0005h
CCP5CON_CCP5X_POSITION                   equ 0005h
CCP5CON_CCP5X_SIZE                       equ 0001h
CCP5CON_CCP5X_LENGTH                     equ 0001h
CCP5CON_CCP5X_MASK                       equ 0020h

