GopalSaraf/Practicals/PSDL/include/proc/pic18lf46k80.inc
// Register: PMD0
#define PMD0 PMD0
PMD0                                     equ 0F59h
// bitfield definitions
PMD0_SSPMD_POSN                          equ 0000h
PMD0_SSPMD_POSITION                      equ 0000h
PMD0_SSPMD_SIZE                          equ 0001h
PMD0_SSPMD_LENGTH                        equ 0001h
PMD0_SSPMD_MASK                          equ 0001h
PMD0_UART1MD_POSN                        equ 0001h
PMD0_UART1MD_POSITION                    equ 0001h
PMD0_UART1MD_SIZE                        equ 0001h
PMD0_UART1MD_LENGTH                      equ 0001h
PMD0_UART1MD_MASK                        equ 0002h
PMD0_UART2MD_POSN                        equ 0002h
PMD0_UART2MD_POSITION                    equ 0002h
PMD0_UART2MD_SIZE                        equ 0001h
PMD0_UART2MD_LENGTH                      equ 0001h
PMD0_UART2MD_MASK                        equ 0004h
PMD0_CCP1MD_POSN                         equ 0003h
PMD0_CCP1MD_POSITION                     equ 0003h
PMD0_CCP1MD_SIZE                         equ 0001h
PMD0_CCP1MD_LENGTH                       equ 0001h
PMD0_CCP1MD_MASK                         equ 0008h
PMD0_CCP2MD_POSN                         equ 0004h
PMD0_CCP2MD_POSITION                     equ 0004h
PMD0_CCP2MD_SIZE                         equ 0001h
PMD0_CCP2MD_LENGTH                       equ 0001h
PMD0_CCP2MD_MASK                         equ 0010h
PMD0_CCP3MD_POSN                         equ 0005h
PMD0_CCP3MD_POSITION                     equ 0005h
PMD0_CCP3MD_SIZE                         equ 0001h
PMD0_CCP3MD_LENGTH                       equ 0001h
PMD0_CCP3MD_MASK                         equ 0020h
PMD0_CCP4MD_POSN                         equ 0006h
PMD0_CCP4MD_POSITION                     equ 0006h
PMD0_CCP4MD_SIZE                         equ 0001h
PMD0_CCP4MD_LENGTH                       equ 0001h
PMD0_CCP4MD_MASK                         equ 0040h
PMD0_CCP5MD_POSN                         equ 0007h
PMD0_CCP5MD_POSITION                     equ 0007h
PMD0_CCP5MD_SIZE                         equ 0001h
PMD0_CCP5MD_LENGTH                       equ 0001h
PMD0_CCP5MD_MASK                         equ 0080h
PMD0_SPI1MD_POSN                         equ 0001h
PMD0_SPI1MD_POSITION                     equ 0001h
PMD0_SPI1MD_SIZE                         equ 0001h
PMD0_SPI1MD_LENGTH                       equ 0001h
PMD0_SPI1MD_MASK                         equ 0002h
PMD0_SPI2MD_POSN                         equ 0002h
PMD0_SPI2MD_POSITION                     equ 0002h
PMD0_SPI2MD_SIZE                         equ 0001h
PMD0_SPI2MD_LENGTH                       equ 0001h
PMD0_SPI2MD_MASK                         equ 0004h

// Register: IOCB
#define IOCB IOCB
IOCB                                     equ 0F5Ah
// bitfield definitions
IOCB_IOCB4_POSN                          equ 0004h
IOCB_IOCB4_POSITION                      equ 0004h
IOCB_IOCB4_SIZE                          equ 0001h
IOCB_IOCB4_LENGTH                        equ 0001h
IOCB_IOCB4_MASK                          equ 0010h
IOCB_IOCB5_POSN                          equ 0005h
IOCB_IOCB5_POSITION                      equ 0005h
IOCB_IOCB5_SIZE                          equ 0001h
IOCB_IOCB5_LENGTH                        equ 0001h
IOCB_IOCB5_MASK                          equ 0020h
IOCB_IOCB6_POSN                          equ 0006h
IOCB_IOCB6_POSITION                      equ 0006h
IOCB_IOCB6_SIZE                          equ 0001h
IOCB_IOCB6_LENGTH                        equ 0001h
IOCB_IOCB6_MASK                          equ 0040h
IOCB_IOCB7_POSN                          equ 0007h
IOCB_IOCB7_POSITION                      equ 0007h
IOCB_IOCB7_SIZE                          equ 0001h
IOCB_IOCB7_LENGTH                        equ 0001h
IOCB_IOCB7_MASK                          equ 0080h

// Register: WPUB
#define WPUB WPUB
WPUB                                     equ 0F5Bh
// bitfield definitions
WPUB_WPUB0_POSN                          equ 0000h
WPUB_WPUB0_POSITION                      equ 0000h
WPUB_WPUB0_SIZE                          equ 0001h
WPUB_WPUB0_LENGTH                        equ 0001h
WPUB_WPUB0_MASK                          equ 0001h
WPUB_WPUB1_POSN                          equ 0001h
WPUB_WPUB1_POSITION                      equ 0001h
WPUB_WPUB1_SIZE                          equ 0001h
WPUB_WPUB1_LENGTH                        equ 0001h
WPUB_WPUB1_MASK                          equ 0002h
WPUB_WPUB2_POSN                          equ 0002h
WPUB_WPUB2_POSITION                      equ 0002h
WPUB_WPUB2_SIZE                          equ 0001h
WPUB_WPUB2_LENGTH                        equ 0001h
WPUB_WPUB2_MASK                          equ 0004h
WPUB_WPUB3_POSN                          equ 0003h
WPUB_WPUB3_POSITION                      equ 0003h
WPUB_WPUB3_SIZE                          equ 0001h
WPUB_WPUB3_LENGTH                        equ 0001h
WPUB_WPUB3_MASK                          equ 0008h
WPUB_WPUB4_POSN                          equ 0004h
WPUB_WPUB4_POSITION                      equ 0004h
WPUB_WPUB4_SIZE                          equ 0001h
WPUB_WPUB4_LENGTH                        equ 0001h
WPUB_WPUB4_MASK                          equ 0010h
WPUB_WPUB5_POSN                          equ 0005h
WPUB_WPUB5_POSITION                      equ 0005h
WPUB_WPUB5_SIZE                          equ 0001h
WPUB_WPUB5_LENGTH                        equ 0001h
WPUB_WPUB5_MASK                          equ 0020h
WPUB_WPUB6_POSN                          equ 0006h
WPUB_WPUB6_POSITION                      equ 0006h
WPUB_WPUB6_SIZE                          equ 0001h
WPUB_WPUB6_LENGTH                        equ 0001h
WPUB_WPUB6_MASK                          equ 0040h
WPUB_WPUB7_POSN                          equ 0007h
WPUB_WPUB7_POSITION                      equ 0007h
WPUB_WPUB7_SIZE                          equ 0001h
WPUB_WPUB7_LENGTH                        equ 0001h
WPUB_WPUB7_MASK                          equ 0080h

// Register: ANCON1
#define ANCON1 ANCON1
ANCON1                                   equ 0F5Ch
// bitfield definitions
ANCON1_ANSEL8_POSN                       equ 0000h
ANCON1_ANSEL8_POSITION                   equ 0000h
ANCON1_ANSEL8_SIZE                       equ 0001h
ANCON1_ANSEL8_LENGTH                     equ 0001h
ANCON1_ANSEL8_MASK                       equ 0001h
ANCON1_ANSEL9_POSN                       equ 0001h
ANCON1_ANSEL9_POSITION                   equ 0001h
ANCON1_ANSEL9_SIZE                       equ 0001h
ANCON1_ANSEL9_LENGTH                     equ 0001h
ANCON1_ANSEL9_MASK                       equ 0002h
ANCON1_ANSEL10_POSN                      equ 0002h
ANCON1_ANSEL10_POSITION                  equ 0002h
ANCON1_ANSEL10_SIZE                      equ 0001h
ANCON1_ANSEL10_LENGTH                    equ 0001h
ANCON1_ANSEL10_MASK                      equ 0004h
ANCON1_ANSEL11_POSN                      equ 0003h
ANCON1_ANSEL11_POSITION                  equ 0003h
ANCON1_ANSEL11_SIZE                      equ 0001h
ANCON1_ANSEL11_LENGTH                    equ 0001h
ANCON1_ANSEL11_MASK                      equ 0008h
ANCON1_ANSEL12_POSN                      equ 0004h
ANCON1_ANSEL12_POSITION                  equ 0004h
ANCON1_ANSEL12_SIZE                      equ 0001h
ANCON1_ANSEL12_LENGTH                    equ 0001h
ANCON1_ANSEL12_MASK                      equ 0010h
ANCON1_ANSEL13_POSN                      equ 0005h
ANCON1_ANSEL13_POSITION                  equ 0005h
ANCON1_ANSEL13_SIZE                      equ 0001h
ANCON1_ANSEL13_LENGTH                    equ 0001h
ANCON1_ANSEL13_MASK                      equ 0020h
ANCON1_ANSEL14_POSN                      equ 0006h
ANCON1_ANSEL14_POSITION                  equ 0006h
ANCON1_ANSEL14_SIZE                      equ 0001h
ANCON1_ANSEL14_LENGTH                    equ 0001h
ANCON1_ANSEL14_MASK                      equ 0040h
ANCON1_PCFG8_POSN                        equ 0000h
ANCON1_PCFG8_POSITION                    equ 0000h
ANCON1_PCFG8_SIZE                        equ 0001h
ANCON1_PCFG8_LENGTH                      equ 0001h
ANCON1_PCFG8_MASK                        equ 0001h
ANCON1_PCFG9_POSN                        equ 0001h
ANCON1_PCFG9_POSITION                    equ 0001h
ANCON1_PCFG9_SIZE                        equ 0001h
ANCON1_PCFG9_LENGTH                      equ 0001h
ANCON1_PCFG9_MASK                        equ 0002h
ANCON1_PCFG10_POSN                       equ 0002h
ANCON1_PCFG10_POSITION                   equ 0002h
ANCON1_PCFG10_SIZE                       equ 0001h
ANCON1_PCFG10_LENGTH                     equ 0001h
ANCON1_PCFG10_MASK                       equ 0004h
ANCON1_PCFG11_POSN                       equ 0003h
ANCON1_PCFG11_POSITION                   equ 0003h
ANCON1_PCFG11_SIZE                       equ 0001h
ANCON1_PCFG11_LENGTH                     equ 0001h
ANCON1_PCFG11_MASK                       equ 0008h
ANCON1_PCFG12_POSN                       equ 0004h
ANCON1_PCFG12_POSITION                   equ 0004h
ANCON1_PCFG12_SIZE                       equ 0001h
ANCON1_PCFG12_LENGTH                     equ 0001h
ANCON1_PCFG12_MASK                       equ 0010h
ANCON1_PCFG13_POSN                       equ 0005h
ANCON1_PCFG13_POSITION                   equ 0005h
ANCON1_PCFG13_SIZE                       equ 0001h
ANCON1_PCFG13_LENGTH                     equ 0001h
ANCON1_PCFG13_MASK                       equ 0020h
ANCON1_PCFG14_POSN                       equ 0006h
ANCON1_PCFG14_POSITION                   equ 0006h
ANCON1_PCFG14_SIZE                       equ 0001h
ANCON1_PCFG14_LENGTH                     equ 0001h
ANCON1_PCFG14_MASK                       equ 0040h

